
# Auto-generated by Interface Designer
#
# WARNING: Any manual changes made to this file will be lost when generating constraints.

# Efinity Interface Designer SDC
# Version: 2025.1.110
# Date: 2025-07-22 23:34

# Copyright (C) 2013 - 2025 Efinix Inc. All rights reserved.

# Device: T8F81
# Project: PWMIOExpander
# Timing Model: C2 (final)

# Oscillator Constraints
########################
create_clock -period 100000 -name OSC [get_ports {OSC}]

# PLL Constraints
#################
create_clock -period 30.003 -waveform {15.002 30.003} -name MainCLK [get_ports {MainCLK}]
create_clock -period 3840.384 -waveform {1920.192 3840.384} -name PWM_Clock [get_ports {PWM_Clock}]

# GPIO Constraints
####################
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {Buttons[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {Buttons[0]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {Buttons[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {Buttons[1]}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {Read}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {Read}]
create_clock -period 30 -name shift_CLK [get_ports {shift_register_CLK}]
# create_generated_clock -name RXCLKIn -source [get_ports {shift_register_CLK}] -divide_by 8 [get_pins {PWM_IO_Expander|RXCLKIN}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {shift_register_Data}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {shift_register_Data}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {shift_register_HOLD}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {shift_register_HOLD}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {Write}]
# set_input_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {Write}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {LED0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {LED0}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {OnBoardLEDs[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {OnBoardLEDs[0]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {OnBoardLEDs[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {OnBoardLEDs[1]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {OnBoardLEDs[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {OnBoardLEDs[2]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -max <MAX CALCULATION> [get_ports {OnBoardLEDs[3]}]
# set_output_delay -clock <CLOCK> [-reference_pin <clkout_pad>] -min <MIN CALCULATION> [get_ports {OnBoardLEDs[3]}]

# Clock groups
############################
set_clock_groups -exclusive -group {MainCLK PWM_Clock} -group {shift_CLK}

# Clock Latency Constraints
############################
# set_clock_latency -source -setup <board_max + 1.785> [get_ports {shift_register_CLK}]
# set_clock_latency -source -hold <board_min + 0.637> [get_ports {shift_register_CLK}]
